; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p14---int100n150-m25---int100c110---s247---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 p5 p6 p7 p8 p9 p10 p11 p12 p13 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 - fuellevel
)

(:init
(sum level0 level11 level11)
(sum level0 level20 level20)
(sum level0 level22 level22)
(sum level1 level11 level12)
(sum level1 level20 level21)
(sum level1 level22 level23)
(sum level2 level11 level13)
(sum level2 level20 level22)
(sum level2 level22 level24)
(sum level3 level11 level14)
(sum level3 level20 level23)
(sum level3 level22 level25)
(sum level4 level11 level15)
(sum level4 level20 level24)
(sum level4 level22 level26)
(sum level5 level11 level16)
(sum level5 level20 level25)
(sum level5 level22 level27)
(sum level6 level11 level17)
(sum level6 level20 level26)
(sum level6 level22 level28)
(sum level7 level11 level18)
(sum level7 level20 level27)
(sum level7 level22 level29)
(sum level8 level11 level19)
(sum level8 level20 level28)
(sum level8 level22 level30)
(sum level9 level11 level20)
(sum level9 level20 level29)
(sum level9 level22 level31)
(sum level10 level11 level21)
(sum level10 level20 level30)
(sum level10 level22 level32)
(sum level11 level11 level22)
(sum level11 level20 level31)
(sum level11 level22 level33)
(sum level12 level11 level23)
(sum level12 level20 level32)
(sum level12 level22 level34)
(sum level13 level11 level24)
(sum level13 level20 level33)
(sum level13 level22 level35)
(sum level14 level11 level25)
(sum level14 level20 level34)
(sum level14 level22 level36)
(sum level15 level11 level26)
(sum level15 level20 level35)
(sum level15 level22 level37)
(sum level16 level11 level27)
(sum level16 level20 level36)
(sum level16 level22 level38)
(sum level17 level11 level28)
(sum level17 level20 level37)
(sum level17 level22 level39)
(sum level18 level11 level29)
(sum level18 level20 level38)
(sum level18 level22 level40)
(sum level19 level11 level30)
(sum level19 level20 level39)
(sum level19 level22 level41)
(sum level20 level11 level31)
(sum level20 level20 level40)
(sum level20 level22 level42)
(sum level21 level11 level32)
(sum level21 level20 level41)
(sum level21 level22 level43)
(sum level22 level11 level33)
(sum level22 level20 level42)
(sum level22 level22 level44)
(sum level23 level11 level34)
(sum level23 level20 level43)
(sum level23 level22 level45)
(sum level24 level11 level35)
(sum level24 level20 level44)
(sum level24 level22 level46)
(sum level25 level11 level36)
(sum level25 level20 level45)
(sum level25 level22 level47)
(sum level26 level11 level37)
(sum level26 level20 level46)
(sum level26 level22 level48)
(sum level27 level11 level38)
(sum level27 level20 level47)
(sum level27 level22 level49)
(sum level28 level11 level39)
(sum level28 level20 level48)
(sum level28 level22 level50)
(sum level29 level11 level40)
(sum level29 level20 level49)
(sum level29 level22 level51)
(sum level30 level11 level41)
(sum level30 level20 level50)
(sum level30 level22 level52)
(sum level31 level11 level42)
(sum level31 level20 level51)
(sum level31 level22 level53)
(sum level32 level11 level43)
(sum level32 level20 level52)
(sum level32 level22 level54)
(sum level33 level11 level44)
(sum level33 level20 level53)
(sum level33 level22 level55)
(sum level34 level11 level45)
(sum level34 level20 level54)
(sum level34 level22 level56)
(sum level35 level11 level46)
(sum level35 level20 level55)
(sum level35 level22 level57)
(sum level36 level11 level47)
(sum level36 level20 level56)
(sum level36 level22 level58)
(sum level37 level11 level48)
(sum level37 level20 level57)
(sum level37 level22 level59)
(sum level38 level11 level49)
(sum level38 level20 level58)
(sum level38 level22 level60)
(sum level39 level11 level50)
(sum level39 level20 level59)
(sum level39 level22 level61)
(sum level40 level11 level51)
(sum level40 level20 level60)
(sum level40 level22 level62)
(sum level41 level11 level52)
(sum level41 level20 level61)
(sum level41 level22 level63)
(sum level42 level11 level53)
(sum level42 level20 level62)
(sum level42 level22 level64)
(sum level43 level11 level54)
(sum level43 level20 level63)
(sum level43 level22 level65)
(sum level44 level11 level55)
(sum level44 level20 level64)
(sum level44 level22 level66)
(sum level45 level11 level56)
(sum level45 level20 level65)
(sum level45 level22 level67)
(sum level46 level11 level57)
(sum level46 level20 level66)
(sum level46 level22 level68)
(sum level47 level11 level58)
(sum level47 level20 level67)
(sum level47 level22 level69)
(sum level48 level11 level59)
(sum level48 level20 level68)
(sum level48 level22 level70)
(sum level49 level11 level60)
(sum level49 level20 level69)
(sum level50 level11 level61)
(sum level50 level20 level70)
(sum level51 level11 level62)
(sum level52 level11 level63)
(sum level53 level11 level64)
(sum level54 level11 level65)
(sum level55 level11 level66)
(sum level56 level11 level67)
(sum level57 level11 level68)
(sum level58 level11 level69)
(sum level59 level11 level70)

(connected l0 l1)
(fuelcost level22 l0 l1)
(connected l0 l2)
(fuelcost level20 l0 l2)
(connected l1 l0)
(fuelcost level22 l1 l0)
(connected l1 l2)
(fuelcost level11 l1 l2)
(connected l2 l0)
(fuelcost level20 l2 l0)
(connected l2 l1)
(fuelcost level11 l2 l1)

(at t0 l2)
(fuel t0 level70)
(= (total-cost) 0)

(at p0 l1)
(at p1 l0)
(at p2 l1)
(at p3 l2)
(at p4 l2)
(at p5 l1)
(at p6 l1)
(at p7 l1)
(at p8 l0)
(at p9 l0)
(at p10 l0)
(at p11 l1)
(at p12 l2)
(at p13 l0)
)

(:goal
(and
(at p0 l0)
(at p1 l1)
(at p2 l2)
(at p3 l1)
(at p4 l1)
(at p5 l2)
(at p6 l2)
(at p7 l0)
(at p8 l2)
(at p9 l1)
(at p10 l2)
(at p11 l0)
(at p12 l0)
(at p13 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 14
2. (load p3 t0 l2)
   deleted: (at p3 l2)
   added: (in p3 t0)
   goals met: 0 of 14
3. (load p12 t0 l2)
   deleted: (at p12 l2)
   added: (in p12 t0)
   goals met: 0 of 14
4. (drive t0 l2 l1 level59 level11 level70)
   deleted: (at t0 l2) (fuel t0 level70)
   added: (at t0 l1) (fuel t0 level59)
   goals met: 0 of 14
5. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 1 of 14
6. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 2 of 14
7. (load p7 t0 l1)
   deleted: (at p7 l1)
   added: (in p7 t0)
   goals met: 2 of 14
8. (load p6 t0 l1)
   deleted: (at p6 l1)
   added: (in p6 t0)
   goals met: 2 of 14
9. (load p5 t0 l1)
   deleted: (at p5 l1)
   added: (in p5 t0)
   goals met: 2 of 14
10. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 2 of 14
11. (load p11 t0 l1)
   deleted: (at p11 l1)
   added: (in p11 t0)
   goals met: 2 of 14
12. (load p0 t0 l1)
   deleted: (at p0 l1)
   added: (in p0 t0)
   goals met: 2 of 14
13. (drive t0 l1 l0 level37 level22 level59)
   deleted: (at t0 l1) (fuel t0 level59)
   added: (at t0 l0) (fuel t0 level37)
   goals met: 2 of 14
14. (load p1 t0 l0)
   deleted: (at p1 l0)
   added: (in p1 t0)
   goals met: 2 of 14
15. (load p10 t0 l0)
   deleted: (at p10 l0)
   added: (in p10 t0)
   goals met: 2 of 14
16. (load p13 t0 l0)
   deleted: (at p13 l0)
   added: (in p13 t0)
   goals met: 2 of 14
17. (load p8 t0 l0)
   deleted: (at p8 l0)
   added: (in p8 t0)
   goals met: 2 of 14
18. (load p9 t0 l0)
   deleted: (at p9 l0)
   added: (in p9 t0)
   goals met: 2 of 14
19. (unload p0 t0 l0)
   deleted: (in p0 t0)
   added: (at p0 l0)
   goals met: 3 of 14
20. (unload p11 t0 l0)
   deleted: (in p11 t0)
   added: (at p11 l0)
   goals met: 4 of 14
21. (unload p12 t0 l0)
   deleted: (in p12 t0)
   added: (at p12 l0)
   goals met: 5 of 14
22. (unload p7 t0 l0)
   deleted: (in p7 t0)
   added: (at p7 l0)
   goals met: 6 of 14
23. (drive t0 l0 l1 level15 level22 level37)
   deleted: (at t0 l0) (fuel t0 level37)
   added: (at t0 l1) (fuel t0 level15)
   goals met: 6 of 14
24. (unload p1 t0 l1)
   deleted: (in p1 t0)
   added: (at p1 l1)
   goals met: 7 of 14
25. (unload p13 t0 l1)
   deleted: (in p13 t0)
   added: (at p13 l1)
   goals met: 8 of 14
26. (unload p9 t0 l1)
   deleted: (in p9 t0)
   added: (at p9 l1)
   goals met: 9 of 14
27. (drive t0 l1 l2 level4 level11 level15)
   deleted: (at t0 l1) (fuel t0 level15)
   added: (at t0 l2) (fuel t0 level4)
   goals met: 9 of 14
28. (unload p10 t0 l2)
   deleted: (in p10 t0)
   added: (at p10 l2)
   goals met: 10 of 14
29. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 11 of 14
30. (unload p5 t0 l2)
   deleted: (in p5 t0)
   added: (at p5 l2)
   goals met: 12 of 14
31. (unload p6 t0 l2)
   deleted: (in p6 t0)
   added: (at p6 l2)
   goals met: 13 of 14
32. (unload p8 t0 l2)
   deleted: (in p8 t0)
   added: (at p8 l2)
   goals met: 14 of 14
